
public class 변수문자열_52 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		String news="기후위기와 생태학살로 드러나는 우리 사회의 불평등과 부정의. 하루하루 현실로 다가오는 생존의 위기 앞에서 과연 다른 세계는 가능할 것인가를 묻는다. "
				+ "\r\n"
				+ "다른 세계는 물론 가능하다고 믿는다. 다만 다른 행성이 아니라 바로 여기 우리가 살고 있는 지구, 우리가 발 딛고 있는 땅과 아직 푸른 하늘과 바다에서, 우리와 함께 살아가는 나무와 새들, 함께 호흡하는 뭇생명들이 공존하는 세계를 함께 상상하고자 한다";
		String news2="""
				기후위기와 생태학살로 드러나는 우리 사회의 불평등과 부정의. 하루하루 현실로 다가오는 생존의 위기 앞에서 과연 다른 세계는 가능할 것인가를 묻는다. 
				다른 세계는 물론 가능하다고 믿는다. 다만 다른 행성이 아니라 바로 여기 우리가 살고 있는 지구, 우리가 발 딛고 있는 땅과 아직 푸른 하늘과 바다에서, 
				우리와 함께 살아가는 나무와 새들, 함께 호흡하는 뭇생명들이 공존하는 세계를 함께 상상하고자 한다""";
		
				System.out.println(news);
				System.out.println(news2);
	}

}
